#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-AkuXUeB16QtD9Reu

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_api_gateway_integration.integration: Refreshing state... [id=agi-qnvmgu9rlh-al7w62-POST]
module.security_demo.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.security_demo.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.security_demo.aws_api_gateway_resource.resource: Refreshing state... [id=al7w62]
module.security_demo.aws_api_gateway_model.model: Refreshing state... [id=eio5d0]
module.security_demo.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.security_demo.aws_api_gateway_method.method: Refreshing state... [id=agm-qnvmgu9rlh-al7w62-POST]
module.security_demo.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-qnvmgu9rlh-al7w62-POST-200]
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=qnvmgu9rlh]
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=ihj63dfy4l]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=xct5vd]
module.security_demo.aws_api_gateway_integration.options: Refreshing state... [id=agi-qnvmgu9rlh-al7w62-OPTIONS]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=1lsitd]
module.security_demo.aws_api_gateway_method.options: Refreshing state... [id=agm-qnvmgu9rlh-al7w62-OPTIONS]
module.security_demo.aws_api_gateway_method_response.options: Refreshing state... [id=agmr-qnvmgu9rlh-al7w62-OPTIONS-200]
module.security_demo.aws_api_gateway_stage.stage: Refreshing state... [id=ags-qnvmgu9rlh-test]
module.security_demo.aws_api_gateway_integration_response.options: Refreshing state... [id=agir-qnvmgu9rlh-al7w62-OPTIONS-200]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=qnvmgu9rlh-test-*/*]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=35dwin]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=155e333c-d687-4682-9d74-f62807218e7d]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=ihj63dfy4l]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/155e333c-d687-4682-9d74-f62807218e7d,arn:aws:apigateway:us-east-1::/restapis/qnvmgu9rlh/stages/test]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.security_demo.aws_api_gateway_stage.stage has changed
  ~ resource "aws_api_gateway_stage" "stage" {
      ~ deployment_id         = "1lsitd" -> "0hbfzc"
        id                    = "ags-qnvmgu9rlh-test"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.security_demo.aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2021-10-14T04:02:17Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:531133914787:qnvmgu9rlh/" -> (known after apply)
      ~ id            = "1lsitd" -> (known after apply)
      ~ invoke_url    = "https://qnvmgu9rlh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "3b77e21da625e4257f45e6fbe1ed07a248589c5c" -> "9cd59dff531df3ad7567e8d779e16678b96b1301"
        }
        # (1 unchanged attribute hidden)
    }

  # module.security_demo.aws_api_gateway_integration.integration will be destroyed
  # (because aws_api_gateway_integration.integration is not in configuration)
  - resource "aws_api_gateway_integration" "integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "al7w62" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-qnvmgu9rlh-al7w62-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "al7w62" -> null
      - rest_api_id             = "qnvmgu9rlh" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:531133914787:function:tf_lambda/invocations" -> null
    }

  # module.security_demo.aws_api_gateway_integration.options must be replaced
-/+ resource "aws_api_gateway_integration" "options" {
      - cache_key_parameters = [] -> null
      ~ cache_namespace      = "al7w62" -> (known after apply)
      ~ id                   = "agi-qnvmgu9rlh-al7w62-OPTIONS" -> (known after apply)
      - request_parameters   = {} -> null
      ~ resource_id          = "al7w62" -> "y7ay07alpb" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.security_demo.aws_api_gateway_integration_response.options must be replaced
-/+ resource "aws_api_gateway_integration_response" "options" {
      ~ id                  = "agir-qnvmgu9rlh-al7w62-OPTIONS-200" -> (known after apply)
      ~ resource_id         = "al7w62" -> "y7ay07alpb" # forces replacement
      - response_templates  = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.security_demo.aws_api_gateway_method.method will be destroyed
  # (because aws_api_gateway_method.method is not in configuration)
  - resource "aws_api_gateway_method" "method" {
      - api_key_required     = true -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-qnvmgu9rlh-al7w62-POST" -> null
      - request_models       = {
          - "application/json" = "UserModel"
        } -> null
      - request_parameters   = {
          - "method.request.header.content-type" = true
          - "method.request.header.x-api-key"    = true
          - "method.request.querystring.code"    = true
        } -> null
      - request_validator_id = "xct5vd" -> null
      - resource_id          = "al7w62" -> null
      - rest_api_id          = "qnvmgu9rlh" -> null
    }

  # module.security_demo.aws_api_gateway_method.options must be replaced
-/+ resource "aws_api_gateway_method" "options" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-qnvmgu9rlh-al7w62-OPTIONS" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "al7w62" -> "y7ay07alpb" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.security_demo.aws_api_gateway_method_response.options must be replaced
-/+ resource "aws_api_gateway_method_response" "options" {
      ~ id                  = "agmr-qnvmgu9rlh-al7w62-OPTIONS-200" -> (known after apply)
      ~ resource_id         = "al7w62" -> "y7ay07alpb" # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.security_demo.aws_api_gateway_method_response.response_200 will be destroyed
  # (because aws_api_gateway_method_response.response_200 is not in configuration)
  - resource "aws_api_gateway_method_response" "response_200" {
      - http_method         = "POST" -> null
      - id                  = "agmr-qnvmgu9rlh-al7w62-POST-200" -> null
      - resource_id         = "al7w62" -> null
      - response_models     = {} -> null
      - response_parameters = {} -> null
      - rest_api_id         = "qnvmgu9rlh" -> null
      - status_code         = "200" -> null
    }

  # module.security_demo.aws_api_gateway_model.model will be destroyed
  # (because aws_api_gateway_model.model is not in configuration)
  - resource "aws_api_gateway_model" "model" {
      - content_type = "application/json" -> null
      - description  = "Request schema model." -> null
      - id           = "eio5d0" -> null
      - name         = "UserModel" -> null
      - rest_api_id  = "qnvmgu9rlh" -> null
      - schema       = jsonencode(
            {
              - $schema              = "http://json-schema.org/draft-04/schema#"
              - additionalProperties = false
              - properties           = {
                  - myname = {
                      - type = "string"
                    }
                }
              - required             = [
                  - "myname",
                ]
              - title                = "UserModel"
              - type                 = "object"
            }
        ) -> null
    }

  # module.security_demo.aws_api_gateway_resource.resource will be destroyed
  # (because aws_api_gateway_resource.resource is not in configuration)
  - resource "aws_api_gateway_resource" "resource" {
      - id          = "al7w62" -> null
      - parent_id   = "y7ay07alpb" -> null
      - path        = "/event" -> null
      - path_part   = "event" -> null
      - rest_api_id = "qnvmgu9rlh" -> null
    }

  # module.security_demo.aws_api_gateway_stage.stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "stage" {
      ~ deployment_id         = "0hbfzc" -> (known after apply)
        id                    = "ags-qnvmgu9rlh-test"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.security_demo.aws_iam_role.iam_for_lambda will be destroyed
  # (because aws_iam_role.iam_for_lambda is not in configuration)
  - resource "aws_iam_role" "iam_for_lambda" {
      - arn                   = "arn:aws:iam::531133914787:role/tf_lambda_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-10-14T04:02:03Z" -> null
      - force_detach_policies = false -> null
      - id                    = "tf_lambda_role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "tf_lambda_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXXKQML2RVVKS6DXPB" -> null

      - inline_policy {}
    }

  # module.security_demo.aws_lambda_function.function will be destroyed
  # (because aws_lambda_function.function is not in configuration)
  - resource "aws_lambda_function" "function" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:531133914787:function:tf_lambda" -> null
      - description                    = "Application security demo, deployed by Terraform." -> null
      - filename                       = "./modules/security_demo/resources/lambda_function.zip" -> null
      - function_name                  = "tf_lambda" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "tf_lambda" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:531133914787:function:tf_lambda/invocations" -> null
      - last_modified                  = "2022-01-10T03:07:51.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:531133914787:function:tf_lambda:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::531133914787:role/tf_lambda_role" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "wnX4/eJliYH11DNDuKmos+LKLZhqAgVmLxBcvBzPiVk=" -> null
      - source_code_size               = 687 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CORS"     = "*"
              - "ENCODING" = "latin-1"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.security_demo.aws_lambda_permission.apigw_lambda will be destroyed
  # (because aws_lambda_permission.apigw_lambda is not in configuration)
  - resource "aws_lambda_permission" "apigw_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "tf_lambda" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:531133914787:qnvmgu9rlh/*/POST/event" -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # module.security_demo_endpoint_01.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "qnvmgu9rlh"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.security_demo_endpoint_01.aws_api_gateway_integration.options will be created
  + resource "aws_api_gateway_integration" "options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "qnvmgu9rlh"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.security_demo_endpoint_01.aws_api_gateway_integration_response.options will be created
  + resource "aws_api_gateway_integration_response" "options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "qnvmgu9rlh"
      + status_code         = "200"
    }

  # module.security_demo_endpoint_01.aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required     = true
      + authorization        = "NONE"
      + http_method          = "POST"
      + id                   = (known after apply)
      + request_models       = {
          + "application/json" = "RequestModel"
        }
      + request_parameters   = {
          + "method.request.header.content-type" = true
          + "method.request.header.x-api-key"    = true
          + "method.request.querystring.code"    = true
        }
      + request_validator_id = "xct5vd"
      + resource_id          = (known after apply)
      + rest_api_id          = "qnvmgu9rlh"
    }

  # module.security_demo_endpoint_01.aws_api_gateway_method.options will be created
  + resource "aws_api_gateway_method" "options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "qnvmgu9rlh"
    }

  # module.security_demo_endpoint_01.aws_api_gateway_method_response.options will be created
  + resource "aws_api_gateway_method_response" "options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "qnvmgu9rlh"
      + status_code         = "200"
    }

  # module.security_demo_endpoint_01.aws_api_gateway_method_response.response_200 will be created
  + resource "aws_api_gateway_method_response" "response_200" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = "qnvmgu9rlh"
      + status_code = "200"
    }

  # module.security_demo_endpoint_01.aws_api_gateway_model.model will be created
  + resource "aws_api_gateway_model" "model" {
      + content_type = "application/json"
      + description  = "Request schema model."
      + id           = (known after apply)
      + name         = "RequestModel"
      + rest_api_id  = "qnvmgu9rlh"
      + schema       = jsonencode(
            {
              + $schema              = "http://json-schema.org/draft-04/schema#"
              + additionalProperties = false
              + properties           = {
                  + myname = {
                      + type = "string"
                    }
                }
              + required             = [
                  + "myname",
                ]
              + title                = "UserModel"
              + type                 = "object"
            }
        )
    }

  # module.security_demo_endpoint_01.aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = "y7ay07alpb"
      + path        = (known after apply)
      + path_part   = "event"
      + rest_api_id = "qnvmgu9rlh"
    }

  # module.security_demo_endpoint_01.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.security_demo_endpoint_01.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "Application security demo, deployed by Terraform."
      + filename                       = "./modules/security_demo_endpoint/resources/lambda_function.zip"
      + function_name                  = "tf_lambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "ots4BiC8wuBWxmIBImq8U+F38Kk4yuUtVEfkDZIEN0Y="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CORS"     = "*"
              + "ENCODING" = "latin-1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.security_demo_endpoint_01.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf_lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-east-1:531133914787:qnvmgu9rlh/*/POST/event"
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 17 to add, 1 to change, 13 to destroy.

Changes to Outputs:
  ~ api_endpoint = "https://qnvmgu9rlh.execute-api.us-east-1.amazonaws.com/test/event" -> "https://qnvmgu9rlh.execute-api.us-east-1.amazonaws.com/test/<endpoint-path-part>"

```

</details>

*Pusher: @fer1035, Action: `pull_request`*